app/controllers/items_controller.rb

INSERT INTO "items" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 26 Sep 2013 14:02:24 UTC +00:00], ["name", "name1"], ["price", 4000], ["updated_at", Thu, 26 Sep 2013 14:02:24 UTC +00:00]]
---
  def create
    @item = Item.new params.require(:item).permit(:name, :price)

    @item.save

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @item = Item.find params[:id]